Repository: kenichisutan/canadian-budget-en-fr-sentiment-analysis
Catalog: data/corpora/federal-budget/budget-2025-en-budget-2025-fr.tmx
Source language: en_en
Languages: fr_fr

source: Marginal note: Exclusion (1.31) Subsection (1.3) does not apply to a dividend if: (a) the following conditions are satisfied: (i) in the taxation year of the payee corporation in which the dividend was received, the payee corporation paid, on or before the payer-due day, one or more taxable dividends (in this subsection referred to as the "payee dividend") the total amount of which equals or exceeds the amount of the dividend received by the payee corporation, (ii) if applicable, in the taxation year of each corporation (in this subsection referred to as a "grandparent corporation") that is affiliated with the payer corporation immediately before the time the dividend is paid and that received, directly or indirectly through one or more trusts, partnerships or grandparent corporations, all or a portion of the payee dividend, the grandparent corporation paid, on or before the payer-due day, one or more taxable dividends (in this subsection referred to as the "grandparent dividend") the total amount of which equals or exceeds the amount of the payee dividend received, directly or indirectly, by the grandparent corporation, and (iii) no portion of the payee dividend referred to in subparagraph (i) or the grandparent dividend referred to in subparagraph (ii) is otherwise relied on by any taxpayer to avoid the application of subsection (1.3); or (b) the payer corporation was subject to a loss restriction event within 30 days after the payer corporation paid the dividend that, but for this paragraph, would be subject to subsection (1.3).
fr_fr: Note marginale : Exclusion (1.31) Le paragraphe (1.3) ne s'applique pas à un dividende si, selon le cas : a) les conditions ci-après sont remplies : (i) dans l'année d'imposition de la société bénéficiaire au cours de laquelle le dividende est reçu, la société bénéficiaire a versé, au plus tard à la date d'exigibilité du payeur, un ou plusieurs dividendes imposables (appelé « dividende du bénéficiaire » au présent paragraphe) dont la somme totale est égale ou supérieure au montant du dividende reçu par la société bénéficiaire, (ii) s'il y a lieu, dans l'année d'imposition de chaque société (appelée « société grand-mère » au présent paragraphe) qui est affiliée à la société payante immédiatement avant le moment du versement du dividende et qui a reçu, directement ou indirectement, par l'intermédiaire d'une ou de plusieurs fiducies, sociétés de personnes ou sociétés grands-mères, la totalité ou une partie du dividende du bénéficiaire, la société grand-mère a versé, au plus tard à la date d'exigibilité du payeur, un ou plusieurs dividendes imposables (appelé « dividende grand-mère » au présent paragraphe) dont la somme totale est égale ou supérieure au montant du dividende du bénéficiaire reçu, directement ou indirectement, par la société grand-mère, (iii) aucun contribuable ne s'appuie par ailleurs sur aucune partie du dividende du bénéficiaire visé au sous-alinéa (i) ou du dividende grand-mère visé au sous-alinéa (ii) pour éviter l'application du paragraphe (1.3); b) la société payante est assujettie à un fait lié à la restriction de pertes dans les 30 jours après le versement par celle-ci du dividende qui, si ce n'était du présent alinéa, serait assujetti au paragraphe (1.3).

source: Marginal note: Release of suspended dividend refund (1.32) For the purpose of subsection (1), a payer corporation is deemed to have paid at the end of a particular taxation year a taxable dividend equal to the amount of a dividend that was subject to subsection (1.3) in a taxation year of the payer corporation preceding the particular taxation year (in this subsection referred to as the "suspended dividend") if the following conditions are met: (a) between the time the suspended dividend was paid and the end of the particular taxation year (i) the payer corporation was not subject to a loss restriction event, and (ii) the payee corporation, and if applicable each grandparent corporation (described in subparagraph (1.31)(a)(ii) at the time subsection (1.3) applied to the payer corporation in respect of the suspended dividend), paid one or more taxable dividends the total amount of which equals or exceeds the amount of the suspended dividend, and the dividends were received, directly or indirectly through one or more trusts, partnerships or grandparent corporations, by a taxpayer that was not (A) a corporation that was affiliated with the payer corporation immediately before the time the suspended dividend was paid, or (B) a private corporation or a subject corporation, within the meaning assigned by subsection 186(3), (in this subsection referred to as the "connected corporation") that was connected, within the meaning assigned by subsection 186(4), with the payee corporation or a grandparent corporation at the time that the payee corporation or the grandparent corporation paid the taxable dividend, unless: (I) in the taxation year of the connected corporation in which the dividend was received, the connected corporation paid, by the end of the particular taxation year, one or more taxable dividends (in this subsection referred to as the "connected dividend") the total amount of which equals or exceeds the amount of the dividend received, and (II) if applicable, in the taxation year of each corporation (in this subsection referred to as a "connected parent or grandparent corporation") that is connected (within the meaning assigned by subsection 186(4)) with the connected corporation immediately before the time the connected dividend is paid and that received, directly or indirectly through one or more trusts, partnerships or connected parent or grandparent corporations, all or a portion of the connected dividend, the connected parent or grandparent corporation paid, by the end of the particular taxation year, one or more taxable dividends the total amount of which equals or exceeds their share of the connected dividend received; (b) no amount in respect of the taxable dividends paid under paragraph (a) are relied on by any taxpayer (other than the payer corporation) to (i) obtain a dividend refund under subsection (1), or (ii) avoid the application of subsection (1.3); and (c) this subsection has not previously applied in respect of the suspended dividend.
fr_fr: Note marginale : Levée — remboursement au titre de dividendes suspendu (1.32) Pour l'application du paragraphe (1), une société payante est réputée avoir versé, à la fin d'une année d'imposition donnée, un dividende imposable égal au montant d'un dividende qui était assujetti au paragraphe (1.3) dans une année d'imposition de la société payante qui précède l'année d'imposition donnée (appelé « dividende suspendu » au présent paragraphe), si les conditions ci-après sont remplies : a) entre le moment du paiement du dividende suspendu et la fin de l'année d'imposition donnée, (i) la société payante n'a pas été assujettie à un fait lié à la restriction de pertes, (ii) la société bénéficiaire, et s'il y a lieu chacune des sociétés grands-mères (visée au sous-alinéa (1.31)a)(ii) au moment où le paragraphe (1.3) s'appliquait à la société payante relativement au dividende suspendu), a versé un ou plusieurs dividendes imposables dont la somme totale est égale ou supérieure au montant du dividende suspendu, et les dividendes ont été reçus, directement ou indirectement par l'intermédiaire d'une ou de plusieurs fiducies, sociétés de personnes ou sociétés grands-mères, par un contribuable qui n'était : (A) ni une société qui était affiliée à la société payante immédiatement avant le moment du versement du dividende suspendu, (B) ni une société privée ou une société assujettie, au sens du paragraphe 186(3), (appelé « société rattachée » au présent paragraphe) qui était rattachée, au sens du paragraphe 186(4), à la société bénéficiaire ou à une société grand-mère au moment où la société bénéficiaire ou la société grand-mère a versé le dividende imposable, sauf si, à la fois : (I) dans l'année d'imposition de la société rattachée au cours de laquelle le dividende a été reçu, la société rattachée a versé, avant la fin de l'année d'imposition donnée, un ou plusieurs dividendes imposables (appelés « dividende rattaché » au présent paragraphe) dont la somme totale est égale ou supérieure au montant du dividende reçu, (II) le cas échéant, dans l'année d'imposition de chaque société (appelée « société mère ou grand-mère rattachée » au présent paragraphe) qui est rattachée (au sens du paragraphe 186(4)) à la société rattachée immédiatement avant le moment du versement du dividende rattaché et qui a reçu, directement ou indirectement par l'intermédiaire d'une ou de plusieurs fiducies, sociétés de personnes ou sociétés mères ou grands-mères rattachées, la totalité ou une partie du dividende rattaché, la société mère ou grand-mère rattachée a versé, avant la fin de l'année d'imposition donnée, un ou plusieurs dividendes imposables dont la somme totale est égale ou supérieure à sa part du dividende rattaché reçu; b) aucun contribuable (à l'exception de la société payante) ne s'appuie sur un montant relatif aux dividendes imposables versés en vertu de l'alinéa a) : (i) soit pour obtenir un remboursement au titre de dividendes en application du paragraphe (1), (ii) soit pour éviter l'application du paragraphe (1.3); c) le présent paragraphe ne s'est pas appliqué antérieurement relativement au dividende suspendu.

source: Marginal note: Assessments (1.33) Despite subsections 152(4) to (5), such assessments, reassessments, determinations and redeterminations may be made as are necessary to give effect to subsections (1.3) to (1.32).
fr_fr: Note marginale : Cotisations (1.33) Malgré les paragraphes 152(4) à (5), le ministre peut établir les cotisations et les nouvelles cotisations voulues et déterminer ou déterminer de nouveau les montants voulus pour l'application des paragraphes (1.3) à (1.32).

source: (2) Subsection (1) applies to dividends paid in taxation years that begin on or after Budget Day.
fr_fr: (2) Le paragraphe (1) s'applique aux dividendes versés dans les années d'imposition qui commencent à compter du jour du budget.

source: 3 (1) The portion of paragraph 186(1)(b) of the Act before subparagraph (i) is replaced by the following: (b) all amounts, each of which is an amount in respect of an assessable dividend received by the particular corporation in the year from a private corporation or a subject corporation that was a payer corporation connected with the particular corporation, equal to that proportion of the payer corporation's dividend refund (within the meaning assigned by paragraph 129(1)(a), if this Act were read without reference to subsection 129(1.32)) for its taxation year in which it paid the dividend that
fr_fr: 3 (1) Le passage de l'alinéa 186(1)b) de la même loi précédant le sous-alinéa (i) est remplacé par ce qui suit : b) les montants représentant chacun un montant au titre d'un dividende imposable déterminé qu'elle a reçu au cours de l'année d'une société privée ou d'une société assujettie qui était une société payante à laquelle elle était rattachée, égal au produit de la multiplication du remboursement au titre de dividendes, au sens de l'alinéa 129(1)a) et s'il n'était pas tenu compte du paragraphe 129(1.32), de la société payante pour son année d'imposition au cours de laquelle elle a versé le dividende par le rapport entre :

source: (2) Subparagraph 186(1)(b)(i) of the Act is replaced by the following: (i) the amount of the dividend received by the particular corporation (excluding any amount subject to subsection 129(1.3))
fr_fr: (2) Le sous-alinéa 186(1)b)(i) de la même loi est remplacé par ce qui suit : (i) d'une part, le dividende reçu par la société donnée (à l'exclusion de tout montant assujetti au paragraphe 129(1.3)),

source: (3) Subparagraph 186(1)(b)(ii) of the Act is replaced by the following: (ii) the total of all taxable dividends paid by the payer corporation in its taxation year in which it paid the dividend and at a time when it was a private corporation or a subject corporation (excluding any amount subject to subsection 129(1.3))
fr_fr: (3) Le sous-alinéa 186(1)b)(ii) de la même loi est remplacé par ce qui suit : (ii) d'autre part, le total des dividendes imposables versés par la société payante au cours de son année d'imposition pendant laquelle elle a versé le dividende et à un moment où elle était une société privée ou une société assujettie (à l'exclusion de toute somme assujettie au paragraphe 129(1.3)),

source: (4) Subsections (1) to (3) are deemed to come into force on Budget Day.
fr_fr: (4) Les paragraphes (1) à (3) sont réputés être entrés en vigueur le jour du budget.

source: 1 The Act is modified to give effect to the proposals relating to the Eligible activities under the Canadian Exploration Expense as described in the budget documents tabled by the Minister of Finance in the House of Commons on Budget Day.
fr_fr: 1 La Loi est modifiée pour donner effet aux propositions relatives aux Activités admissibles au titre des frais d'exploration au Canada énoncées dans les documents budgétaires déposés à la Chambre des communes par la ministre des Finances le jour du budget.

source: 1 (1) Subsection 142.7(4) of the Act is replaced by the following: Marginal note: Deemed fair market value (4) If a Canadian affiliate of an entrant bank and the entrant bank make an election under subsection (3) in respect of a transfer of property by the Canadian affiliate to the entrant bank, for the purposes of subsections 15(1), 52(2), 69(1), (4) and (5), 246(1) and 247(2.02) in respect of the transfer, the fair market value of the property is deemed to be the amount agreed by the Canadian affiliate and the entrant bank in their election.
fr_fr: 1 (1) Le paragraphe 142.7(4) de la même loi est remplacé par ce qui suit : Note marginale : Juste valeur marchande réputée (4) Lorsqu'une filiale canadienne d'une banque entrante et celle-ci font le choix prévu au paragraphe (3) relativement au transfert d'un bien de la filiale canadienne à la banque entrante, la juste valeur marchande du bien est réputée, pour l'application des paragraphes 15(1), 52(2), 69(1), (4) et (5), 246(1) et 247(2.02) relativement au transfert, être égale au montant dont la filiale canadienne et la banque entrante ont convenu aux termes de leur choix.

source: (2) Subsection (1) applies to taxation years and fiscal periods that begin after Budget Day.
fr_fr: (2) Le paragraphe (1) s'applique aux années d'imposition et aux exercices commençant après le jour du budget.

source: 2 (1) The definitions arm's length allocation , arm's length transfer price , tax benefit and transfer price in subsection 247(1) of the Act are repealed.
fr_fr: 2 (1) Les définitions de attribution de pleine concurrence , avantage fiscal , prix de transfert et prix de transfert de pleine concurrence , au paragraphe 247(1) de la même loi, sont abrogées.

source: (2) The definitions transfer pricing income adjustment and transfer pricing income setoff adjustment in subsection 247(1) of the Act are replaced by the following: transfer pricing income adjustment transfer pricing income adjustment of a taxpayer for a taxation year means the total of all amounts each of which is the amount, if any, by which an adjustment made under subsection (2.02) (other than an adjustment included in determining a transfer pricing capital adjustment of the taxpayer for a taxation year) would result in an increase in the taxpayer's income for the year or a decrease in a loss of the taxpayer for the year from a source if that adjustment were the only adjustment made under subsection (2.02). ( redressement de revenu ) transfer pricing income setoff adjustment transfer pricing income setoff adjustment of a taxpayer for a taxation year means the total of all amounts each of which is the amount, if any, by which an adjustment made under subsection (2.02) (other than an adjustment included in determining a transfer pricing capital setoff adjustment of the taxpayer for a taxation year) would result in a decrease in the taxpayer's income for the year or an increase in a loss of the taxpayer for the year from a source if that adjustment were the only adjustment made under subsection (2.02). ( redressement compensatoire de revenu )
fr_fr: (2) Les définitions de redressement compensatoire de revenu et redressement de revenu , au paragraphe 247(1) de la même loi, sont respectivement remplacées par ce qui suit : redressement compensatoire de revenu redressement compensatoire de revenu Quant à un contribuable pour une année d'imposition, le total des montants représentant chacun le montant éventuel qui, par suite d'un redressement effectué en vertu du paragraphe (2.02) (sauf un redressement entrant dans le calcul d'un redressement compensatoire de capital du contribuable pour une année d'imposition), réduirait le revenu du contribuable pour l'année, ou augmenterait sa perte pour l'année provenant d'une source, si le redressement en question était le seul effectué en vertu de ce paragraphe. ( transfer pricing income setoff adjustment ) redressement de revenu redressement de revenu Quant à un contribuable pour une année d'imposition, le total des montants représentant chacun le montant éventuel qui, par suite d'un redressement effectué en vertu du paragraphe (2.02) (sauf un redressement entrant dans le calcul d'un redressement de capital du contribuable pour une année d'imposition), augmenterait le revenu du contribuable pour l'année, ou réduirait sa perte pour l'année provenant d'une source, si le redressement en question était le seul effectué en vertu de ce paragraphe. ( transfer pricing income adjustment )

source: (3) Subparagraph (a)(i) of the definition transfer pricing capital adjustment in subsection 247(1) of the Act is replaced by the following: (i) 1/2 of the amount, if any, by which the adjusted cost base to the taxpayer of a capital property (other than a depreciable property) is reduced in the year because of an adjustment made under subsection (2.02), or
fr_fr: (3) Le sous-alinéa a)(i) de la définition de redressement de capital , au paragraphe 247(1) de la même loi, est remplacé par ce qui suit : (i) la moitié du montant éventuel qui, au cours de l'année et en raison d'un redressement effectué en vertu du paragraphe (2.02), est appliqué en réduction du prix de base rajusté pour le contribuable d'une immobilisation (sauf un bien amortissable),

source: (4) Subparagraph (a)(iii) of the definition transfer pricing capital adjustment in subsection 247(1) of the Act is replaced by the following: (iii) the amount, if any, by which the capital cost to the taxpayer of a depreciable property is reduced in the year because of an adjustment made under subsection (2.02); and
fr_fr: (4) Le sous-alinéa a)(iii) de la définition de redressement de capital , au paragraphe 247(1) de la même loi, est remplacé par ce qui suit : (iii) le montant éventuel qui, au cours de l'année et en raison d'un redressement effectué en vertu du paragraphe (2.02), est appliqué en réduction du coût en capital pour le contribuable d'un bien amortissable;

source: (5) Subparagraph (b)(i) of the definition transfer pricing capital adjustment in subsection 247(1) of the Act is replaced by the following: (i) 1/2 of the amount, if any, by which the adjusted cost base to a partnership of a capital property (other than a depreciable property) is reduced in a fiscal period that ends in the year because of an adjustment made under subsection (2.02), and
fr_fr: (5) Le sous-alinéa b)(i) de la définition de redressement de capital , au paragraphe 247(1) de la même loi, est remplacé par ce qui suit : (i) la moitié du montant éventuel qui, au cours d'un exercice se terminant dans l'année et en raison d'un redressement effectué en vertu du paragraphe (2.02), est appliqué en réduction du prix de base rajusté pour une société de personnes d'une immobilisation (sauf un bien amortissable),

source: (6) Subparagraph (b)(iii) of the definition transfer pricing capital adjustment in subsection 247(1) of the Act is replaced by the following: (iii) the amount, if any, by which the capital cost to a partnership of a depreciable property is reduced in the period because of an adjustment made under subsection (2.02),
fr_fr: (6) Le sous-alinéa b)(iii) de la définition de redressement de capital , au paragraphe 247(1) de la même loi, est remplacé par ce qui suit : (iii) le montant éventuel qui, au cours de l'exercice et en raison d'un redressement effectué en vertu du paragraphe (2.02), est appliqué en réduction du coût en capital pour une société de personnes d'un bien amortissable,
